{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "SiameseNetwork", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 100, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_img"}, "name": "input_img", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 100, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "validation_img"}, "name": "validation_img", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "embedding", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 100, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_image"}, "name": "input_image", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [10, 10], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_16", "inbound_nodes": [[["input_image", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_12", "trainable": true, "dtype": "float32", "pool_size": [64, 64], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_12", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_17", "inbound_nodes": [[["max_pooling2d_12", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_13", "trainable": true, "dtype": "float32", "pool_size": [64, 64], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_13", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_18", "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_14", "trainable": true, "dtype": "float32", "pool_size": [64, 64], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_14", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_19", "inbound_nodes": [[["max_pooling2d_14", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_4", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 4096, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_17", "inbound_nodes": [[["flatten_4", 0, 0, {}]]]}], "input_layers": [["input_image", 0, 0]], "output_layers": [["dense_17", 0, 0]]}, "name": "embedding", "inbound_nodes": [[["input_img", 0, 0, {}]], [["validation_img", 0, 0, {}]]]}, {"class_name": "L1Dist", "config": {"name": "distance", "trainable": true, "dtype": "float32"}, "name": "distance", "inbound_nodes": [[["embedding", 1, 0, {"validation_embedding": ["embedding", 2, 0]}]]]}, {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_18", "inbound_nodes": [[["distance", 0, 0, {}]]]}], "input_layers": [["input_img", 0, 0], ["validation_img", 0, 0]], "output_layers": [["dense_18", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of38.bin", "group1-shard2of38.bin", "group1-shard3of38.bin", "group1-shard4of38.bin", "group1-shard5of38.bin", "group1-shard6of38.bin", "group1-shard7of38.bin", "group1-shard8of38.bin", "group1-shard9of38.bin", "group1-shard10of38.bin", "group1-shard11of38.bin", "group1-shard12of38.bin", "group1-shard13of38.bin", "group1-shard14of38.bin", "group1-shard15of38.bin", "group1-shard16of38.bin", "group1-shard17of38.bin", "group1-shard18of38.bin", "group1-shard19of38.bin", "group1-shard20of38.bin", "group1-shard21of38.bin", "group1-shard22of38.bin", "group1-shard23of38.bin", "group1-shard24of38.bin", "group1-shard25of38.bin", "group1-shard26of38.bin", "group1-shard27of38.bin", "group1-shard28of38.bin", "group1-shard29of38.bin", "group1-shard30of38.bin", "group1-shard31of38.bin", "group1-shard32of38.bin", "group1-shard33of38.bin", "group1-shard34of38.bin", "group1-shard35of38.bin", "group1-shard36of38.bin", "group1-shard37of38.bin", "group1-shard38of38.bin"], "weights": [{"name": "dense_18/kernel", "shape": [4096, 1], "dtype": "float32"}, {"name": "dense_18/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_16/kernel", "shape": [10, 10, 3, 64], "dtype": "float32"}, {"name": "conv2d_16/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_17/kernel", "shape": [7, 7, 64, 128], "dtype": "float32"}, {"name": "conv2d_17/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_18/kernel", "shape": [4, 4, 128, 128], "dtype": "float32"}, {"name": "conv2d_18/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_19/kernel", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "conv2d_19/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_17/kernel", "shape": [9216, 4096], "dtype": "float32"}, {"name": "dense_17/bias", "shape": [4096], "dtype": "float32"}]}]}